# Підключення модулів (Кольори)

from colorama import *
init()

# Позначення змінних

kr = [Fore.CYAN + '■' + Fore.WHITE + '■' + Fore.RED + '■' + Fore.WHITE + ' Франція', Fore.RED + '■' + Fore.GREEN + '■' + Fore.WHITE + '■' + Fore.BLACK + '■' + Fore.WHITE + ' ОАЕ', Fore.RED + '■' + Fore.WHITE + '■' + Fore.CYAN + '■' + Fore.WHITE + ' Нідерланди', Fore.WHITE + '■' + Fore.RED + '■' + Fore.CYAN + '■' + Fore.WHITE + ' Туреччина', Fore.RED + '+' + Fore.WHITE + ' Швейцарія', Fore.CYAN + '■' + Fore.YELLOW + '■' + ' Україна', Fore.WHITE + '■' + Fore.RED + '■' + ' Польша']
st = ['Париж', 'Абу-Дабі', 'Амстердам', 'Анкара', 'Берн','Київ','Варшава']

k = 0 
i = 0
o = 0

# Перевірки/Активні дії


print(' ')
print('███████╗██╗░░██╗███████╗██████╗░░█████╗░██╗░██████╗███████╗  ░█████╗░')
print('██╔════╝╚██╗██╔╝██╔════╝██╔══██╗██╔══██╗██║██╔════╝██╔════╝  ██╔═══╝░')
print('█████╗░░░╚███╔╝░█████╗░░██████╔╝██║░░╚═╝██║╚█████╗░█████╗░░  ██████╗░')
print('██╔══╝░░░██╔██╗░██╔══╝░░██╔══██╗██║░░██╗██║░╚═══██╗██╔══╝░░  ██╔══██╗')
print('███████╗██╔╝╚██╗███████╗██║░░██║╚█████╔╝██║██████╔╝███████╗  ╚█████╔╝')
print('╚══════╝╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░╚════╝░╚═╝╚═════╝░╚══════╝  ░╚════╝░')
print(Fore.RED + '░██████╗░███████╗░█████╗░░██████╗░██████╗░░█████╗░██████╗░██╗░░██╗██╗░░░██╗  ████████╗███████╗░██████╗████████╗')
print(Fore.RED + '██╔════╝░██╔════╝██╔══██╗██╔════╝░██╔══██╗██╔══██╗██╔══██╗██║░░██║╚██╗░██╔╝  ╚══██╔══╝██╔════╝██╔════╝╚══██╔══╝')
print(Fore.RED + '██║░░██╗░█████╗░░██║░░██║██║░░██╗░██████╔╝███████║██████╔╝███████║░╚████╔╝░  ░░░██║░░░█████╗░░╚█████╗░░░░██║░░░')
print(Fore.RED + '██║░░╚██╗██╔══╝░░██║░░██║██║░░╚██╗██╔══██╗██╔══██║██╔═══╝░██╔══██║░░╚██╔╝░░  ░░░██║░░░██╔══╝░░░╚═══██╗░░░██║░░░')
print(Fore.RED + '╚██████╔╝███████╗╚█████╔╝╚██████╔╝██║░░██║██║░░██║██║░░░░░██║░░██║░░░██║░░░  ░░░██║░░░███████╗██████╔╝░░░██║░░░')
print(Fore.RED + '░╚═════╝░╚══════╝░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝░░╚═╝░░░╚═╝░░░  ░░░╚═╝░░░╚══════╝╚═════╝░░░░╚═╝░░░')
print(' ')

while k<3 and i<len(kr):
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Поточна країна:', kr[i])
	s = input(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Назвіть столицю цієї країни: ' + Fore.CYAN)
	if s == st[i]:
		print(' ')
		print(Fore.YELLOW + '  ╔═══════════════════════════════════════╗')
		print(Fore.YELLOW + '  ║' + Fore.WHITE + '	 + ' + Fore.GREEN + '[ПРАВИЛЬНА ВІДПОВІДЬ]' + Fore.WHITE + ' +' + Fore.YELLOW + '	  ║')
		print(Fore.YELLOW + '  ╚═══════════════════════════════════════╝')
		print(Fore.WHITE + ' ')
		o = o + 1
	else: 
		k = k + 1
		print(' ')
		print(Fore.RED + '  ╔═══════════════════════════════════════╗')
		print(Fore.RED + '  ║' + Fore.WHITE + '	 + ' + Fore.YELLOW + '[НЕПРАВИЛЬНА ВІДПОВІДЬ]' + Fore.WHITE + ' +' + Fore.RED + '	  ║')
		print(Fore.RED + '  ╚═══════════════════════════════════════╝')
		print(Fore.WHITE + ' ')
	i = i + 1

if (k == 0):

	print('')
	print('██████╗░███████╗██████╗░██╗░░░██╗░░███░░░██░░░░░░████████╗░█████╗░████████╗██░░░░░███╗██╗')
	print('██╔══██╗██╔════╝╚════██╗╚██╗░██╔╝░██░██░░██░░░░░░╚══██╔══╝██╔══██╗╚══██╔══╝██░░░██░██║╚═╝')
	print('██████╔╝█████╗░░░█████╔╝░╚████╔╝░██░░░██░██████░░░░░██║░░░███████║░░░██║░░░██░░██║░██║░░░')
	print('██╔═══╝░██╔══╝░░░╚═══██╗░░╚██╔╝░░██░░░██░██╔══██╗░░░██║░░░██╔══██║░░░██║░░░██░██║░░██║░░░')
	print('██║░░░░░███████╗██████╔╝░░░██║░░░██░░░██╗██████╦╝░░░██║░░░██║░░██║░░░██║░░░████║░░░██║██╗')
	print('╚═╝░░░░░╚══════╝╚═════╝░░░░╚═╝░░░╚══════╝╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚═══╝░░╚██╝╚═╝')
	print('')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Помилок зроблено:' + Fore.RED , k)
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відсоток правильних відповідей:' + Fore.GREEN , round(o/7*100) ,Fore.GREEN + '%')	
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Ваша оцінка:' + Fore.GREEN , round(o/7*100/8.333333333333333333333333333) , Fore.GREEN + 'балів')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відгук: "' + Fore.YELLOW + 'Ви зробили тест на удеальному рівні. Ви можете вважати себе знавцем географії!' + Fore.WHITE + '"')	
	print(' ')

elif (k == 1):
	print('')
	print('██████╗░███████╗██████╗░██╗░░░██╗░░███░░░██░░░░░░████████╗░█████╗░████████╗██░░░░░███╗██╗')
	print('██╔══██╗██╔════╝╚════██╗╚██╗░██╔╝░██░██░░██░░░░░░╚══██╔══╝██╔══██╗╚══██╔══╝██░░░██░██║╚═╝')
	print('██████╔╝█████╗░░░█████╔╝░╚████╔╝░██░░░██░██████░░░░░██║░░░███████║░░░██║░░░██░░██║░██║░░░')
	print('██╔═══╝░██╔══╝░░░╚═══██╗░░╚██╔╝░░██░░░██░██╔══██╗░░░██║░░░██╔══██║░░░██║░░░██░██║░░██║░░░')
	print('██║░░░░░███████╗██████╔╝░░░██║░░░██░░░██╗██████╦╝░░░██║░░░██║░░██║░░░██║░░░████║░░░██║██╗')
	print('╚═╝░░░░░╚══════╝╚═════╝░░░░╚═╝░░░╚══════╝╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚═══╝░░╚██╝╚═╝')
	print('')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Помилок зроблено:' + Fore.RED , k)
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відсоток правильних відповідей:' + Fore.GREEN , round(o/7*100) ,Fore.GREEN + '%')	
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Ваша оцінка:' + Fore.GREEN , round(o/7*100/8.333333333333333333333333333) , Fore.GREEN + 'балів')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відгук: "' + Fore.YELLOW + 'Досить непогано. Але ви можете ще краще! Потренуйтеся на політичній карті.' + Fore.WHITE + '"')	
	print(' ')

elif (k == 2):
	print('')
	print('██████╗░███████╗██████╗░██╗░░░██╗░░███░░░██░░░░░░████████╗░█████╗░████████╗██░░░░░███╗██╗')
	print('██╔══██╗██╔════╝╚════██╗╚██╗░██╔╝░██░██░░██░░░░░░╚══██╔══╝██╔══██╗╚══██╔══╝██░░░██░██║╚═╝')
	print('██████╔╝█████╗░░░█████╔╝░╚████╔╝░██░░░██░██████░░░░░██║░░░███████║░░░██║░░░██░░██║░██║░░░')
	print('██╔═══╝░██╔══╝░░░╚═══██╗░░╚██╔╝░░██░░░██░██╔══██╗░░░██║░░░██╔══██║░░░██║░░░██░██║░░██║░░░')
	print('██║░░░░░███████╗██████╔╝░░░██║░░░██░░░██╗██████╦╝░░░██║░░░██║░░██║░░░██║░░░████║░░░██║██╗')
	print('╚═╝░░░░░╚══════╝╚═════╝░░░░╚═╝░░░╚══════╝╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚═══╝░░╚██╝╚═╝')
	print('')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Помилок зроблено:' + Fore.RED , k)
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відсоток правильних відповідей:' + Fore.GREEN , round(o/7*100) ,Fore.GREEN + '%')	
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Ваша оцінка:' + Fore.GREEN + ' 8 балів')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Відгук: "' + Fore.YELLOW + 'Все ж , вам потрібно як-то кажуть "підтянути" свої знання з географії. Передивіться інформацію з шкільного підручника. Ось посилання - ' + Fore.CYAN + 'https://pidruchnyk.com.ua/700-geografiya-7-boyko-2015.html' + Fore.WHITE + '"')	
	print(' ')

else:
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' Тест було предчасно закінчено! Ви зробили більше ніж' + Fore.RED + ' 3 ' + Fore.WHITE + 'помилки.')
	print(Fore.CYAN + '[ІНФОРМАЦІЯ]' + Fore.WHITE + ' В наступний раз постарайтеся краще. І вам обов"язково пощастить!')	
	print(' ')

